Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: སེམས་རྨི་ལམ་དང་འདྲ་བ་རབ་ཏུ་ཞི་བའི་མཚན་ཉིད་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་ཚུལ་ཁྲིམས་སྡོམ་པའི་ཚོགས་སོགས་སོ་ཅོག་དེ་ཐམས་ཅད་མྱུར་བའི་མངོན་པར་ཤེས་པར་སྔོ་བ་དེ་ནི་སྒྲུབ་པའོ། ། སེམས་སྨིག་རྒྱུ་ལྟ་བུ་ཤིན་ཏུ་ཟད་པས་ཟད་པར་གྱུར་པ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ་གང་ཡང་བཟོད་པའི་སྟོབས་དང་། དེས་པ་བྱང་ཆུབ་ཀྱི་རྒྱན་བསྒྲུབ་པའི་ཕྱིར་སྔོ་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། སེམས་ཆུ་ཟླ་ལྟ་བུ་ཤིན་ཏུ་དབེན་པས་དབེན་པ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་བརྩོན་འགྲུས་རྩོམ་པ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྔོ་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། སེམས་གཟུང་དུ་མེད་པ་མི་མཐོང་བ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། མཉམ་པར་གཞག་པ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་དུ་སྔོ་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། སེམས་གཟུགས་མེད་པ། མི་མཐོང་བ། མི་ཐོས་པ། རྣམ་པར་མི་རིག་པ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་དྲིས་པའི་ཚིག་ཐ་དད་པ་བསྟན་པ་ཐམས་ཅད་ཤེས་པས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་སྔོ་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། དམིགས་པ་སྣ་ཚོགས་ལ་སེམས་སྐྱེ་བ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་དགེ་བའི་རྩ་བ་ལ་དམིགས་པའི་སེམས་ཉེ་བར་སྦྱོར་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། རྒྱུ་མེད་པ་ལས་སེམས་མི་སྐྱེ་བ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་རྒྱུའི་སེམས་སྐྱེད་པ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། གང་ཡུལ་མེད་པར་སེམས་མི་སྐྱེ་བ་དེ་ནི་སེམས་ཀྱི་ཆོས་ཉིད་དེ། གང་ཡང་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྒྱུའི་སེམས་ཉེ་བར་སྦྱོར་བ་དེ་ནི་དེའི་སྒྲུབ་པའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པའོ། ། དེ་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་མངོན་པར་ཤེས་པ་ཐོབ་པའི་ཕྱིར་སེམས་ཤིན་ཏུ་འབྲེལ་བར་བྱེད་དེ། དེ་མངོན་པར་ཤེས་པ་ཐོབ་ནས་སེམས་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རབ་ཏུ་ཤེས་ཏེ། ཤེས་ནས་ཀྱང་དེའི་རང་བཞིན་གྱི་ཆོས་འཆད་དོ། །
en: The mind is like a dream; it is characterized by being pacified. This is the actual state of the mind. Still, when one has accumulated all morality and training and transformed it into the superior ability of swiftness, something has been accomplished. The mind is like a mirage, entirely transient. That is the actual state of the mind. Still, when the gentle power of patience has been transformed into the accomplishment that adorns awakening, one has accomplished something. The mind is like the reflection of the moon in a pond, completely disconnected. This is the actual state of the mind. Still, when all one’s efforts have been transformed into that which fulfills all the teachings of the Buddha, one has accomplished something. The mind is ungraspable; it cannot be seen. This is the actual state of the mind. Still, when all the liberative meditative states, the attainments of concentration, have been transformed into the concentration of the Buddha, something has been accomplished. The mind is formless; it is imperceptible, unobstructable, and uncognizable. This is the actual state of the mind. Still, when the knowledge of all the various questions that can be raised has been transformed into the perfect knowledge of the Buddha, something has been accomplished. The mind arises in response to various objects. This is the actual state of the mind. Still, when the object of a root of virtue is brought into contact with the mind, one has accomplished something. The mind does not arise without a cause. This is the actual state of the mind. Still, when the mind that is the cause of the elements that are conducive to awakening has been engendered, something has been accomplished. The mind does not arise without any influence. This is the actual state of the mind. Still, when the mind is brought under the influence of the Buddha, something has been accomplished.’ This, Śāriputra, is how the bodhisatva practices the foundation of mindfulness of the mind by observing the mind. As he dwells on the mind and observes the mind, he steers his mind so that he attains the superior abilities. When he has attained the superior abilities, he is able to know all minds by means of one mind, and with this knowledge he teaches the Dharma of the true nature of the mind.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པའི་ཕྱིར་སེམས་ཉེ་བར་འབྲེལ་བར་བྱེད་དེ། སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བའོ། ། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་སེམས་ཟད་པ་དང་། སེམས་འགག་པར་བྱ་བའི་ཕྱིར་སེམས་གནས་པར་མི་བྱེད་ཀྱི། འཁོར་བའི་རྒྱུན་གྱི་ཀུན་ཏུ་སྦྱོར་བ་རྣམས་ཀྱིས་སེམས་མངོན་པར་སྒྲུབ་སྟེ སེམས་ཀྱི་དྲན་པ་ཤེས་པ་དེ་མ་སྐྱེས་པ་དང་། མི་སྐྱེ་བ་ངེས་པར་གྱུར་པ་ལ་ཞུགས་པའི་ཆོས་རྣམས་ཀྱི་གནས་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་ངོ་། ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་གྱི་བར་དུ་སེམས་ཀྱི་རྒྱུད་དེ་རྒྱུན་ཆགས་པར་བྱེད་དོ། ། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Moreover, as he dwells on the mind and observes the mind, the bodhisatva steers his mind so that he attains great compassion. When he has attained great compassion, he will not tire until all sentient beings have been brought to maturity. As he dwells on the mind and observes the mind, he does not maintain an attitude of wanting to eliminate the mind, of wanting to shut the mind off, but instead he develops a desire to relate to the workings of cyclic existence. With the knowledge that comes from paying attention to the mind, he arrives at certainty about the fact that there is no birth and no origination, and dwelling in the Dharma in this way, he does not fall to the level of a śrāvaka or a pratyekabuddha. There will still be some clinging to the stream of thoughts as long as he has not developed all the qualities of a buddha, but with the wisdom that arises in that one moment when these qualities are present, unsurpassed perfect awakening is attained. This, Śāriputra, is how the bodhisatva practices the foundation of mindfulness of the mind by observing the mind.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་མོ། ། ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་ཡིན་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་འཕགས་པའི་ཤེས་རབ་ཀྱི་མིག་གིས་ཆོས་གང་མཐོང་བ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དུ་བར་མ་དོར་རྨོངས་པར་མི་འགྱུར་ཏེ དེ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་གང་སྟོང་པ་ཉིད་དུ་མ་གཏོགས་པ་དང་། མཚན་མ་མེད་པར་མ་གཏོགས་པ་དང་། སྨོན་པ་མེད་པར་མ་གཏོགས་པ་དང་། མི་སྐྱེ་བར་མ་གཏོགས་པ་དང་། མ་སྐྱེས་པར་མ་གཏོགས་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པར་མ་གཏོགས་པ་དང་། དངོས་པོ་མེད་པར་མ་གཏོགས་པའི་ཆོས་རྡུལ་ཙམ་ཡང་མི་མཐོང་ངོ་། ། གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མ་གཏོགས་པའི་ཆོས་རྡུལ་ཙམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ཆོས་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་གི །ཆོས་མ་ཡིན་པ་མི་མཐོང་ངོ་། །
en: “Now, Śāriputra, how does the bodhisatva practice the foundation of mindfulness of phenomena by observing phenomena? Śāriputra, the bodhisatva sees phenomena with the wisdom eye of the noble ones, and he does not become confused by them, even temporarily, while on his way to the seat of awakening. When he dwells observing phenomena in this way, he does not perceive any phenomena, however small, that escape emptiness, that escape freedom from attributes, that escape freedom from aspirations, that escape freedom from origination, that escape freedom from arising, that escape freedom from being conditioned, or that escape freedom from an entity. He does not perceive any phenomena, however small, that escape dependent origination. When he dwells in this observation of phenomena, the bodhisatva perceives truth, and not untruth.

source: དེ་ལ་ཆོས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་མེད་པའི་དོན་དང་། སེམས་ཅན་མེད་པའི་དོན་དང་། སྲོག་མེད་པའི་དོན་དང་། །གང་ཟག་མེད་པའི་དོན་ཏེ། དེ་ནི་ཆོས་ཞེས་བྱའོ། ། དེ་ལ་ཆོས་མ་ཡིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་། སྲོག་ཏུ་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། འབྱུང་བར་ལྟ་བ་དང་། འཇིག་པར་ལྟ་བ་སྟེ། དེ་ནི་ཆོས་མ་ཡིན་པ་ཞེས་བྱའོ། ། ཡང་ཤཱ་རིའི་བུ་ཆོས་ཐམས་ཅད་ཆོས་སོ། ། ཆོས་ཐམས་ཅད་ཆོས་མ་ཡིན་པའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཤེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཆོས་སོ། ། བདག་དང་བདག་གིར་ལྟ་བའི་བག་ལ་ཉལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཆོས་མ་ཡིན་པའོ། ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་ཆོས་དེ་དག་ལ་གང་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་ཡིན་པ་གང་ལས་བྱང་ཆུབ་ཏུ་མི་འགྱུར་བ་དང་། གང་ལས་སངས་རྒྱས་སུ་མི་འགྱུར་བ་དང་། གང་ལས་ལམ་དུ་མི་འགྱུར་བ་དང་། གང་ལས་ཐར་པར་མི་འགྱུར་བ་དང་། གང་ལས་འབྱུང་བར་མི་འགྱུར་བའི་ཆོས་རྡུལ་ཙམ་ཡང་མི་མཐོང་སྟེ དེ་ཆོས་ཐམས་ཅད་འབྱུང་བར་ཤེས་ནས་སྒྲིབ་པ་མེད་པ་ཞེས་བྱ་བའི་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་ཡང་དེ་དག་ཉོན་མོངས་པ་དང་བཅས་པ་མ་ཡིན་གྱི། དེ་དག་ཉོན་མོངས་པ་མེད་པའོ་ཞེས་བཅོས་མར་འདུ་ཤེས་སྐྱེད་དོ། །
en: “What is truth? It is the fact that there is no self, no being, no life force, and no person. This is what is known as truth. What is untruth? It is the view that there is a self, a being, a life force, or a person. It is the view of annihilation, the view of permanence, the view of existence, and the view of nonexistence. This is what is known as untruth. Thus, Śāriputra, all phenomena are true, and all phenomena are untrue. How so? When one understands emptiness, freedom from attributes, and freedom from aspirations all phenomena are true. If one tends to think in terms of me and mine, all phenomena are untrue. When the bodhisatva dwells on phenomena and observes phenomena, he does not perceive any phenomena that are anything other than the qualities of the Buddha, that do not lead to awakening, that do not lead to buddhahood, that do not lead to the path, that do not lead to liberation, and that do not lead to release. Because he sees all phenomena as release, he attains the kind of great compassion that is called unhindered. He comes to the conclusion that the corruptions of all sentient beings are made up. He reflects, ‘They are not connected with the vices—they are beyond the vices.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་དེ་དག་ནི་ངེས་པའི་དོན་ལ་ཡང་དག་པར་འཇུག་པ་སྟེ། ཉོན་མོངས་པ་རྣམས་ལ་བསགས་པ་འམ། ཕུང་པོའི་དངོས་པོ་མེད་དེ། དེ་དག་ཉིད་རྗེས་སུ་རྟོགས་པའི་ཕྱིར་བྱང་ཆུབ་བོ། །ཉོན་མོངས་པའི་རང་བཞིན་གང་ཡིན་པ་བྱང་ཆུབ་ཀྱི་རང་བཞིན་ཡང་དེ་ཡིན་ནོ། ། བྱང་ཆུབ་ཀྱི་རང་བཞིན་གང་ཡིན་པ་ཉོན་མོངས་པའི་རང་བཞིན་ཡང་དེ་ཡིན་ཏེ། དེ་ལྟར་དྲན་པ་ཉེ་བར་གཞོག་ཀྱང་ཅུང་ཟད་ཀྱང་ཉེ་བར་འཇོག་པ་མེད། རབ་ཏུ་འཇོག་པ་མེད། མི་འཇོག་པ་མེད་དེ། ཆོས་ཉིད་དེ་གནས་པ་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ། ། དེ་བས་ན་ཆོས་ཀྱི་དབྱིངས་དེ་ནི་གནས་པ་ཉིད་ཅེས་བྱའོ། ། ཆོས་ཀྱི་དབྱིངས་གནས་གང་ལ་གནས་པ་སེམས་ཅན་གྱི་ཁམས་ཀྱང་གནས་དེ་ལ་གནས་སོ། ། སེམས་ཅན་གྱི་ཁམས་གནས་གང་ལ་གནས་པ་ནམ་མཁའི་ཁམས་ཀྱང་དེ་ལ་གནས་ཏེ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་ཞེས་བྱའོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན་སངས་རྒྱས་ཀྱི་ཆོས་ལ་རྟོན་པ་ཡིན། ཆོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་སུ་མོས་པར་བྱེད་དེ། དེ་ཟད་པར་ཤེས་པ་ཡང་སྐྱེད་མོད་ཀྱི། འདུས་མ་བྱས་པའི་ཟད་པ་ཡང་མངོན་དུ་མི་བྱེད། མི་སྐྱེ་བ་ཤེས་པ་ཡང་མངོན་པར་སྒྲུབ་མོད་ཀྱི། སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་ཡང་སྐྱེ་ལ་མི་སྐྱེ་བའི་མཐའ་དེ་ཡང་མི་གཏོང་ངོ་། །
en: How so? Because they genuinely engage with the explicit meaning of things, they do not accumulate the vices, they do not heap them up, and awakening comes about through this realization. The true nature of vices is the true nature of awakening, and the true nature of awakening is the true nature of vices. If one bears in mind that this is the way things are, then one does not, in fact, keep focus or place one’s mindfulness on anything at all. This is the very state of knowing the way things actually are, and this is why the totality of phenomena is referred to as the very state of things. The constant state of the totality of phenomena is the constant state of the element of beings, and the constant state of the element of beings is the constant state of the element of space. This is why it can be said that all phenomena are like space. The bodhisatva who dwells on phenomena and observes phenomena relies upon the truth of the Buddha, and in this he is in fact relating to all phenomena as the truth of the Buddha. He develops the knowledge of destruction, but he does not attain the destruction of the unconditioned. He attains the knowledge of nonarising, but he still takes birth because of his concern for sentient beings, while not abandoning his ultimate goal of nonbirth.

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དྲན་པ་དེ་ལ་གཞོག་པར་བྱེད་ཅིང་ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་ཇི་སྙེད་ཆོས་སུ་གདགས་པ་དེ་དག་ཐམས་ཅད་མ་ལུས་པར་དྲན་པ་དེ་ལ་འཇོག་སྟེ དྲན་པ་དེ་ཡང་བརྗེད་པར་མི་བྱེད། ཕྱི་མའི་མཐའི་ཡང་བར་དུ་རྨོངས་པར་མི་བྱེད་དོ། ། ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དྲན་པ་ཉེ་བར་གཞག་པའོ། ། ཞེས་བྱ་བ་དེ་ནི་བསྟན་པ་དཔག་ཏུ་མེད་པ་སྟེ། ཀུན་ཏུ་སྤྱོད་ཡུལ་མ་ཡིན་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་འདུ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཚིམ་པར་བྱེད་པ། བདུད་ཐམས་ཅད་འདུལ་བ། རང་བྱུང་བར་རྟོགས་པའི་ཕྱིར་ཏེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་མོ། །
en: “The foundation of mindfulness of phenomena implies maintaining this mindfulness of all phenomena. It implies maintaining mindfulness of all the designations of phenomena without exception, which are related to the teachings of śrāvakas, pratyekabuddhas, and buddhas, and not forgetting them or becoming confused about them until one has reached the final goal. There are an infinite number of presentations of what we call the foundation of mindfulness of phenomena by observing phenomena. There is no limit to its scope. It comprises all the teachings of the Buddha and has the potential to delight all sentient beings, to overcome all māras, and to arrive at self-arisen realization. This, Śāriputra, is how the bodhisatva practices the foundation of mindfulness of phenomena by observing phenomena.

source: དེ་དག་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་པོ་དེ་དག་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: “These are what are known as the four foundations of mindfulness, Śāriputra, and the bodhisatva who is skilled in these four foundations of mindfulness practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་མཁས་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་འདི་བདུན་ཏེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། ཤཱ་རིའི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ནོ། །
en: “What is the bodhisatvas’ skilled approach to the factors of awakening? There are seven factors of awakening for the bodhisatvas. What are these seven factors? They are the factor of perfect awakening of mindfulness, the factor of perfect awakening of examining the Dharma, the factor of perfect awakening of vigor, the factor of perfect awakening of joy, the factor of perfect awakening of calm, the factor of perfect awakening of concentration, and the factor of perfect awakening of equanimity. These, Śāriputra, are the bodhisatvas’ seven factors of awakening.

source: དེ་ལ་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། དྲན་པ་གང་གིས་ཆོས་རྟོག་པར་བྱེད། ཆོས་ལ་སོ་སོར་རྟོག་པར་བྱེད། ཆོས་ལ་དཔྱོད་པར་བྱེད། ཆོས་ཡོངས་སུ་ཚོལ་བར་བྱེད་ཅིང་ཆོས་རྣམ་པར་འབྱེད་པར་བྱེད་པ་དང་། ཆོས་ལ་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་དྲན་པ་དེས་གང་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དེ་ཡང་རྗེས་སུ་རྟོགས་སོ། ། ཡང་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཤེས་པ་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་སྟེ། གང་དེ་ལྟར་དྲན་ཞིང་ཁོང་དུ་ཆུད་པ་དེ་ནི་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of mindfulness? The mindfulness through which phenomena are understood, penetrated, analyzed, investigated, discerned, and examined is the mindfulness that leads to the realization of the essential characteristic of the true nature of phenomena. What is the knowledge of the essential characteristic of the true nature of phenomena? It is that all phenomena are empty of any essential characteristics of their own. Absorbing this kind of mindfulness is what is known as the factor of perfect awakening of mindfulness.

source: དེ་ལ་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། གང་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཤེས་པ་སྟེ། ངེས་པའི་དོན་ཀྱང་ངེས་པའི་དོན་དུ། དྲང་བའི་དོན་ཀྱང་དྲང་བའི་དོན་དུ། ཀུན་རྫོབ་ཀྱི་དོན་ཀྱང་ཀུན་རྫོབ་ཀྱི་དོན་དུ། དོན་དམ་པ་ཡང་དོན་དམ་པར། བརྡ་ཡང་བརྡར། རྣམ་པར་གཏན་ལ་བབ་པ་ཡང་རྣམ་པར་གཏན་ལ་བབ་པར་ཆོས་དེ་དག་ཇི་ལྟར་རབ་ཏུ་དབྱེ་བར་བྱ་བ་དེ་བཞིན་དུ་དེ་དག་རྣམ་པར་འབྱེད་པར་བྱེད་དེ། དེ་ནི་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of examining the Dharma? It is the knowledge of how to examine the eighty-four thousand collections of teachings. The teachings should be examined in an appropriate way: those of explicit meaning according to the explicit meaning, those of implicit meaning according to the implicit meaning, those of relative meaning according to the relative meaning, those of ultimate meaning according to the ultimate meaning, designations according to designations, and ascertainment according to ascertainment. To examine the Dharma in this way is what is known as the factor of perfect awakening of examining the Dharma.

source: དེ་ལ་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། གང་ཆོས་རྣམ་པར་འབྱེད་པ་དེ་ཉིད་ཀྱི་དགའ་བ་དང་། ཤིན་ཏུ་སྦྱངས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། བཏང་སྙོམས་དང་། ཡེ་ཤེས་ཀྱི་བར་ཏུ་འཛིན་པ་དང་། སྤྲོ་བ་དང་། སྟོབས་དང་། རྟུལ་བ་དང་། མི་ཟློགས་པའི་མོས་པ་དང་། མཐུ་དང་། བརྩོན་པ་མི་འདོར་བ་དང་། ལམ་མངོན་པར་རྟོགས་པར་བྱ་བ་ལ་བརྩོན་འགྲུས་རྩོམ་པ་སྟེ། དེ་ནི་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of vigor? It is to take joy in this very examination of the Dharma. It is to be calm, concentrated, and equanimous. It is to possess a firm grasp of knowledge, of the power of delight, and of fortitude. It is unyielding determination, stamina, and not shying away from responsibility. It is to apply vigor in order to realize the path. This is what is known as the factor of perfect awakening of vigor.

source: དེ་ལ་དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། དགའ་བ་གང་དང་། ཆོས་ལ་དགའ་བ་གང་དང་། ཆོས་ལ་མཆོག་ཏུ་དགའ་བ་གང་གིས་སེམས་མི་ཞུམ་ཞིང་དང་བ་སྟེ། མ་ཞུམ་པའི་དགའ་བ་དེས་གང་ལུས་སམ་སེམས་ཀྱང་ཤིན་ཏུ་བྱང་བར་བྱེད་ལ་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་སེལ་བ་དེ་ནི་དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of joy? It is to take joy in the Dharma, to delight in the Dharma, and to be inspired by the Dharma in a way that brings clarity and removes despondency, an irrepressible joy that leaves the body and the mind at peace and that removes the corruptions. This is what is known as the factor of perfect awakening of joy.

source: དེ་ལ་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། གང་ལུས་ཤིན་ཏུ་སྦྱངས་པ་དང་། སེམས་ཤིན་ཏུ་སྦྱངས་པ་དང་། ཉོན་མོངས་པ་ཤིན་ཏུ་སྦྱངས་པ་དང་། སྒྲིབ་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དུ་དམིགས་པ་ལ་སེམས་ཉེ་བར་གཞོག་པ་སྟེ། དེ་ནི་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of calm? It is physical calm, mental calm, the calming of corruptions, the absence of the hindrances, and the settling of the mind on an object of concentration. This is what is known as the factor of perfect awakening of calm.

source: དེ་ལ་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། གང་སེམས་མཉམ་པར་བཞག་པས་ཆོས་ཤེས་པ་རྟོགས་པར་འགྱུར་ཏེ། སེམས་མཉམ་པར་མ་བཞག་པས་ནི་མ་ཡིན་པ་དང་། སེམས་མཉམ་པར་བཞག་པས་ཆོས་དེ་དག་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའི་སེམས་མཉམ་པར་མ་བཞག་པས་མ་ཡིན་ཏེ ཆོས་མཉམ་པ་ཉིད་དང་། ཆོས་ལ་གཞོལ་བ་མ་གཏོགས་པར་རྗེས་སུ་ཆགས་པའི་ཀུན་ནས་དཀྲིས་པས་རྟོགས་པར་མི་བྱེད་དེ། དེ་ནི་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of concentration? A mind that is settled can attain knowledge of phenomena, while a mind that is not settled cannot. A mind that is settled can attain awakening with respect to phenomena, while a mind that is not settled cannot. It is not the abandoning of the impediments of ingrained views that leads to perfect awakening, but rather the sameness of phenomena, the state of absorption in phenomena. This is what is known as the factor of perfect awakening of concentration.

source: དེ་ལ་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཞེ་ན། གང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བའི་ཆ་དང་འཐུན་པའི་ཆོས་རྣམས་ལ་སེམས་མི་འཛིན་པ་དང་། འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མི་འཕྲོགས་པ་དང་། མཐོ་དམན་དུ་མི་གནས་པའི་ཕྱིར་རབ་ཏུ་མི་གཡོ། མི་འཁྲུག ། རབ་ཏུ་མི་འཁྲུག ། ཡང་དག་པར་མི་འཁྲུག ། ཆགས་པར་མི་བྱེད། ཞེ་སྡང་བར་མི་བྱེད་ཀྱི། འཕགས་པའི་ལམ་དེ་ཉིད་དང་འཐུན་པར་བྱེད་པ་སྟེ། དེ་ནི་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཅེས་བྱའོ། །
en: “What is the factor of perfect awakening of equanimity? It is to not adopt an attitude toward things that is either cheerful or depressed. It is to not be carried away by worldly phenomena. It is to remain unmoved by states of elation and dejection, to remain undisturbed by them, not to allow oneself to be interrupted by them, not to be carried away by them, and not to be angered by them, but rather to abide by the noble path. This is what is known as the factor of perfect awakening of equanimity.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།། །།
en: “In this way, Śāriputra, the bodhisatva who is skilled in these seven factors of awakening practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ལ་མཁས་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ནི་འདི་བརྒྱད་དོ། ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ། དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཡན་ལག་བརྒྱད་པའོ། །
en: “What is the bodhisatvas’ skilled approach to the path? The path of the bodhisatvas has eight aspects. What are these eight aspects of the path? They are right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration. This is what is known as the eightfold path of the bodhisatvas.

source: དེ་ལ་ཡང་དག་པའི་ལྟ་བ་གང་ཞེ་ན། ལྟ་བ་གང་འཕགས་པའི་འཇིག་རྟེན་ལས་འདས་པ་སྟེ། བདག་ཏུ་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན། སེམས་ཅན་ཏུ་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན། སྲོག་ཏུ་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན། གང་ཟག་ཏུ་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན། ཆད་པ་དང་། རྟག་པ་དང་། འབྱུང་བ་དང་། འཇིག་པར་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན། དགེ་བ་དང་མི་དགེ་བར་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན་པ་ནས། མྱ་ངན་ལས་འདས་པར་ལྟ་བ་ལས་ལངས་པ་མ་ཡིན་པ་སྟེ། དེ་ནི་ཡང་དག་པའི་ལྟ་བ་ཞེས་བྱའོ། །
en: “What is right view? It is a noble view that is removed from what is worldly. It is not derived from a view of a self, a view of a being, a view of a life force, or a view of a person. It is not derived from the view of annihilation or permanence, of existence or nonexistence. It is not derived from a view of wholesomeness or unwholesomeness, and so forth. It is not derived from a view of nirvāṇa. This is what is known as right view.

source: དེ་ལ་ཡང་དག་པའི་རྟོག་པ་གང་ཞེ་ན། རྟོག་པ་གང་གིས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལ་སོགས་པའི་ཉོན་མོངས་པ་གནས་པར་འགྱུར་བའི་རྟོག་པ་དེ་ལྡང་བར་མི་བྱེད་ཀྱི། རྟོག་པ་གང་གིས་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བར་འབྱུང་བར་འགྱུར་བ་དེ་ལ་རྟོག་པ་སྟེ། དེ་ནི་ཡང་དག་པའི་རྟོག་པ་ཞེས་བྱའོ། །
en: “What is right intention? It is to not cultivate the kind of intentions that lead to vices such as desire, anger, and confusion becoming established. It is to cultivate the kind of intentions that result in morality, concentration, wisdom, liberation, and insight into the knowledge of liberation becoming established. This is what is known as right intention.

source: དེ་ལ་ཡང་དག་པའི་ངག་གང་ཞེ་ན། ཡང་དག་པའི་ངག་གང་གིས་བདག་དང་གཞན་ལ་མི་གདུང་ཞིང་དེ་ཕན་པའི་རྗེས་སུ་སྦྱོར་བའི་ངག་དང་ལྡན་པ་ཡིན་ཏེ། ངག་དེས་ལམ་མཉམ་པ་ལ་འཇུག་པ་དེ་ནི་ཡང་དག་པའི་ངག་ཅེས་བྱའོ། །
en: “What is right speech? It is the kind of speech that does not create pain for oneself or for others and that is full of words that bring benefit. It is speech that leads one to engage with the path of sameness. This is what is known as right speech.
